---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyUncutError
source: html/9b4f449a-6f21-f38f-3cec-af5bb132119d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyUncutError Property

There is a circular chain of references among the highlighted elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircularDependencyUncutError { get; }
```